tests/hi.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>


        <gs:sayHiRequest>
            <gs:text>Spain</gs:text>
        </gs:sayHiRequest>



    </soapenv:Body>
</soapenv:Envelope>
